Revit 2027 API
BuiltInFailures.ArrayFailures.ConstraintsNotSatisfied Property
 Constraints are not satisfied
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConstraintsNotSatisfied { get; }
Public Shared ReadOnly Property ConstraintsNotSatisfied As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConstraintsNotSatisfied {
	FailureDefinitionId^ get ();
}
static member ConstraintsNotSatisfied : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ArrayFailures Class
Autodesk.Revit.DB Namespace